# Alexis Weintraub, RH

In [70]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [81]:
%sql sqlite:///lab4.db3

'Connected: @lab4.db3'

# Question 1

## This creates a Dogs table to run a query on
### This table meets the conditions

In [82]:
%%sql drop table if exists Dogs;     --drops the table if it already exists
create table Dogs(
       id       int,
       name     string,
       color    string,
       age      int
);
insert into Dogs values('11', 'Rover', 'brown', '3');
insert into Dogs values('22', 'Bruno', 'gray', '4');
insert into Dogs values('33', 'Spot', 'white', '6');
insert into Dogs values('44', 'Clifford', 'red', '2');
insert into Dogs values('55', 'Fluffy', 'golden', '7');
insert into Dogs values('11', 'Rover', 'brown', '3');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This prints the Dogs table

In [83]:
%%sql
select *
from Dogs

 * sqlite:///lab4.db3
Done.

[(11, 'Rover', 'brown', 3),
 (22, 'Bruno', 'gray', 4),
 (33, 'Spot', 'white', 6),
 (44, 'Clifford', 'red', 2),
 (55, 'Fluffy', 'golden', 7),
 (11, 'Rover', 'brown', 3)]

### This query checks if {A} (id) is a superkey of {A, B, C, D} (id, name, color, age)

In [84]:
%%sql
SELECT COUNT(*)
FROM Dogs D1, Dogs D2
WHERE D1.id = D2.id AND (D1.name != D2.name OR D1.color != D2.color OR D1.age != D2.age)

 * sqlite:///lab4.db3
Done.

[(0,)]

## This creates a Cats table to run a query on
### This table does not meet the conditions

In [85]:
%%sql drop table if exists Cats;     --drops the table if it already exists
create table Cats(
       id       int,
       name     string,
       color    string,
       age      int
);
insert into Cats values('111', 'Gatsby', 'black', '3');
insert into Cats values('222', 'Nibble', 'gray', '4');
insert into Cats values('333', 'Peaches', 'orange', '6');
insert into Cats values('444', 'Thomas', 'calico', '2');
insert into Cats values('555', 'Lucy', 'white', '7');
insert into Cats values('111', 'Lovely', 'gray', '2');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## This prints the Cats table

In [86]:
%%sql
select *
from Cats

 * sqlite:///lab4.db3
Done.

[(111, 'Gatsby', 'black', 3),
 (222, 'Nibble', 'gray', 4),
 (333, 'Peaches', 'orange', 6),
 (444, 'Thomas', 'calico', 2),
 (555, 'Lucy', 'white', 7),
 (111, 'Lovely', 'gray', 2)]

### This query checks if {A} (id) is a superkey of {A, B, C, D} (id, name, color, age)

In [87]:
%%sql
SELECT COUNT(*)
FROM Cats C1, Cats C2
WHERE C1.id = C2.id AND (C1.name != C2.name OR C1.color != C2.color OR C1.age != C2.age)

 * sqlite:///lab4.db3
Done.

[(2,)]

# Question 2

## This creates a table of Trees, which meets the conditions of each SQL query.
### I use a self-join to compare the values in the table

In [88]:
%%sql drop table if exists Trees;     --drops the table if it already exists
create table Trees(
       id       int,
       type     string,
       age      int,
       height   int
);
insert into Trees values('11', 'Oak', '56', '23');
insert into Trees values('12', 'Birch', '24', '24');
insert into Trees values('13', 'Palm', '12', '6');
insert into Trees values('14', 'Sycamore', '78', '32');
insert into Trees values('15', 'Willow', '37', '27');
insert into Trees values('11', 'Oak', '56', '23');
insert into Trees values('12', 'Birch', '24', '24');
insert into Trees values('13', 'Palm', '12', '6');
insert into Trees values('14', 'Sycamore', '78', '32');
insert into Trees values('15', 'Willow', '37', '27');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This prints the table

In [89]:
%%sql
select *
from Trees

 * sqlite:///lab4.db3
Done.

[(11, 'Oak', 56, 23),
 (12, 'Birch', 24, 24),
 (13, 'Palm', 12, 6),
 (14, 'Sycamore', 78, 32),
 (15, 'Willow', 37, 27),
 (11, 'Oak', 56, 23),
 (12, 'Birch', 24, 24),
 (13, 'Palm', 12, 6),
 (14, 'Sycamore', 78, 32),
 (15, 'Willow', 37, 27)]

### This tests the combination A and B (id and type)

In [90]:
%%sql
SELECT COUNT(*)
FROM Trees T1, Trees T2
WHERE (T1.id = T2.id AND T1.type = T2.type) AND (T1.age != T2.age OR T1.height != T2.height)

 * sqlite:///lab4.db3
Done.

[(0,)]

### This tests the combination A and C (id and age)

In [91]:
%%sql
SELECT COUNT(*)
FROM Trees T1, Trees T2
WHERE (T1.id = T2.id AND T1.age = T2.age) AND (T1.type != T2.type OR T1.height != T2.height)

 * sqlite:///lab4.db3
Done.

[(0,)]

### This tests the combination A and D (id and height)

In [92]:
%%sql
SELECT COUNT(*)
FROM Trees T1, Trees T2
WHERE (T1.id = T2.id AND T1.height = T2.height) AND (T1.age != T2.age OR T1.type != T2.type)

 * sqlite:///lab4.db3
Done.

[(0,)]

### This tests the combination B and C (type and age)

In [93]:
%%sql
SELECT COUNT(*)
FROM Trees T1, Trees T2
WHERE (T1.type = T2.type AND T1.age = T2.age) AND (T1.id != T2.id OR T1.height != T2.height)

 * sqlite:///lab4.db3
Done.

[(0,)]

### This tests the combination B and D (type and height)

In [94]:
%%sql
SELECT COUNT(*)
FROM Trees T1, Trees T2
WHERE (T1.type = T2.type AND T1.height = T2.height) AND (T1.id != T2.id OR T1.age != T2.age)

 * sqlite:///lab4.db3
Done.

[(0,)]

### This tests the combination C and D (age and height)

In [95]:
%%sql
SELECT COUNT(*)
FROM Trees T1, Trees T2
WHERE (T1.age = T2.age AND T1.height = T2.height) AND (T1.id != T2.id OR T1.type != T2.type)

 * sqlite:///lab4.db3
Done.

[(0,)]

## This creates a table of Flowers, which does not meet the conditions of the SQL query
### For this part of question 2, I made a new table similar to the original but slightly different, so that for each query it would not meet the conditions. That is why the names of the flowers, the colors, and the leaves are slightly different every time.

### Here, I created a table so combination A and B would fail

In [97]:
%%sql drop table if exists Flowers;     --drops the table if it already exists
create table Flowers(
       id       int,
       type     string,
       color    string,
       leaves   int
);
insert into Flowers values('111', 'Daffodil', 'white', '3');
insert into Flowers values('112', 'Daisy', 'white', '4');
insert into Flowers values('113', 'Rose', 'red', '6');
insert into Flowers values('114', 'Tulip', 'yellow', '2');
insert into Flowers values('115', 'Violet', 'purple', '6');
insert into Flowers values('111', 'Daffodil', 'brown', '7');
insert into Flowers values('112', 'Daisy', 'orange', '3');
insert into Flowers values('113', 'Rose', 'pink', '5');
insert into Flowers values('114', 'Tulip', 'white', '1');
insert into Flowers values('115', 'Violet', 'magenta', '2');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This prints the first version of the table

In [98]:
%%sql
select *
from Flowers

 * sqlite:///lab4.db3
Done.

[(111, 'Daffodil', 'white', 3),
 (112, 'Daisy', 'white', 4),
 (113, 'Rose', 'red', 6),
 (114, 'Tulip', 'yellow', 2),
 (115, 'Violet', 'purple', 6),
 (111, 'Daffodil', 'brown', 7),
 (112, 'Daisy', 'orange', 3),
 (113, 'Rose', 'pink', 5),
 (114, 'Tulip', 'white', 1),
 (115, 'Violet', 'magenta', 2)]

### This tests the combination A and B (id and type)

In [100]:
%%sql
SELECT COUNT(*)
FROM Flowers F1, Flowers F2
WHERE (F1.id = F2.id AND F1.type = F2.type) AND (F1.color != F2.color OR F1.leaves != F2.leaves)

 * sqlite:///lab4.db3
Done.

[(10,)]

### Here, I created a new table similar to the original so combination A and C would fail

In [101]:
%%sql drop table if exists Flowers2;     --drops the table if it already exists
create table Flowers2(
       id       int,
       type     string,
       color    string,
       leaves   int
);
insert into Flowers2 values('111', 'Daffodil', 'brown', '3');
insert into Flowers2 values('112', 'Daisy', 'white', '4');
insert into Flowers2 values('113', 'Rose', 'pink', '6');
insert into Flowers2 values('114', 'Tulip', 'yellow', '2');
insert into Flowers2 values('115', 'Violet', 'purple', '6');
insert into Flowers2 values('111', 'Mum', 'brown', '7');
insert into Flowers2 values('112', 'Marigold', 'white', '3');
insert into Flowers2 values('113', 'Lily', 'pink', '5');
insert into Flowers2 values('114', 'Hydrangea', 'yellow', '1');
insert into Flowers2 values('115', 'Orchid', 'purple', '2');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This prints the table Flowers2

In [102]:
%%sql
select *
from Flowers2

 * sqlite:///lab4.db3
Done.

[(111, 'Daffodil', 'brown', 3),
 (112, 'Daisy', 'white', 4),
 (113, 'Rose', 'pink', 6),
 (114, 'Tulip', 'yellow', 2),
 (115, 'Violet', 'purple', 6),
 (111, 'Mum', 'brown', 7),
 (112, 'Marigold', 'white', 3),
 (113, 'Lily', 'pink', 5),
 (114, 'Hydrangea', 'yellow', 1),
 (115, 'Orchid', 'purple', 2)]

### This tests the combination A and C (id and color)

In [103]:
%%sql
SELECT COUNT(*)
FROM Flowers2 F1, Flowers2 F2
WHERE (F1.id = F2.id AND F1.color = F2.color) AND (F1.type != F2.type OR F1.leaves != F2.leaves)

 * sqlite:///lab4.db3
Done.

[(10,)]

### Here, I created a new table similar to the original so combination A and D would fail

In [105]:
%%sql drop table if exists Flowers3;     --drops the table if it already exists
create table Flowers3(
       id       int,
       type     string,
       color    string,
       leaves   int
);
insert into Flowers3 values('111', 'Daffodil', 'brown', '3');
insert into Flowers3 values('112', 'Daisy', 'white', '4');
insert into Flowers3 values('113', 'Rose', 'pink', '6');
insert into Flowers3 values('114', 'Tulip', 'yellow', '2');
insert into Flowers3 values('115', 'Violet', 'purple', '6');
insert into Flowers3 values('111', 'Mum', 'brown', '3');
insert into Flowers3 values('112', 'Marigold', 'white', '4');
insert into Flowers3 values('113', 'Lily', 'pink', '6');
insert into Flowers3 values('114', 'Hydrangea', 'yellow', '2');
insert into Flowers3 values('115', 'Orchid', 'purple', '6');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This prints the table Flowers3

In [106]:
%%sql
select *
from Flowers3

 * sqlite:///lab4.db3
Done.

[(111, 'Daffodil', 'brown', 3),
 (112, 'Daisy', 'white', 4),
 (113, 'Rose', 'pink', 6),
 (114, 'Tulip', 'yellow', 2),
 (115, 'Violet', 'purple', 6),
 (111, 'Mum', 'brown', 3),
 (112, 'Marigold', 'white', 4),
 (113, 'Lily', 'pink', 6),
 (114, 'Hydrangea', 'yellow', 2),
 (115, 'Orchid', 'purple', 6)]

### This tests the combination A and D (id and leaves)

In [107]:
%%sql
SELECT COUNT(*)
FROM Flowers3 F1, Flowers3 F2
WHERE (F1.id = F2.id AND F1.leaves = F2.leaves) AND (F1.color != F2.color OR F1.type != F2.type)

 * sqlite:///lab4.db3
Done.

[(10,)]

### Here, I created a new table similar to the original so combination B and C would fail

In [108]:
%%sql drop table if exists Flowers4;     --drops the table if it already exists
create table Flowers4(
       id       int,
       type     string,
       color    string,
       leaves   int
);
insert into Flowers4 values('111', 'Daffodil', 'white', '3');
insert into Flowers4 values('112', 'Daisy', 'white', '4');
insert into Flowers4 values('113', 'Rose', 'red', '6');
insert into Flowers4 values('114', 'Tulip', 'yellow', '2');
insert into Flowers4 values('115', 'Violet', 'purple', '6');
insert into Flowers4 values('116', 'Daffodil', 'white', '7');
insert into Flowers4 values('117', 'Daisy', 'white', '3');
insert into Flowers4 values('118', 'Rose', 'red', '5');
insert into Flowers4 values('119', 'Tulip', 'yellow', '1');
insert into Flowers4 values('120', 'Violet', 'purple', '2');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This prints the table Flowers4

In [109]:
%%sql
select *
from Flowers4

 * sqlite:///lab4.db3
Done.

[(111, 'Daffodil', 'white', 3),
 (112, 'Daisy', 'white', 4),
 (113, 'Rose', 'red', 6),
 (114, 'Tulip', 'yellow', 2),
 (115, 'Violet', 'purple', 6),
 (116, 'Daffodil', 'white', 7),
 (117, 'Daisy', 'white', 3),
 (118, 'Rose', 'red', 5),
 (119, 'Tulip', 'yellow', 1),
 (120, 'Violet', 'purple', 2)]

### This tests the combination B and C (type and color)

In [110]:
%%sql
SELECT COUNT(*)
FROM Flowers4 F1, Flowers4 F2
WHERE (F1.type = F2.type AND F1.color = F2.color) AND (F1.id != F2.id OR F1.leaves != F2.leaves)

 * sqlite:///lab4.db3
Done.

[(10,)]

### Here, I created a new table similar to the original so combination B and D would fail

In [111]:
%%sql drop table if exists Flowers5;     --drops the table if it already exists
create table Flowers5(
       id       int,
       type     string,
       color    string,
       leaves   int
);
insert into Flowers5 values('111', 'Daffodil', 'white', '3');
insert into Flowers5 values('112', 'Daisy', 'white', '4');
insert into Flowers5 values('113', 'Rose', 'red', '6');
insert into Flowers5 values('114', 'Tulip', 'yellow', '2');
insert into Flowers5 values('115', 'Violet', 'purple', '6');
insert into Flowers5 values('116', 'Daffodil', 'brown', '3');
insert into Flowers5 values('117', 'Daisy', 'orange', '4');
insert into Flowers5 values('118', 'Rose', 'pink', '6');
insert into Flowers5 values('119', 'Tulip', 'white', '2');
insert into Flowers5 values('120', 'Violet', 'magenta', '6');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This prints the table Flowers5

In [112]:
%%sql
select *
from Flowers5

 * sqlite:///lab4.db3
Done.

[(111, 'Daffodil', 'white', 3),
 (112, 'Daisy', 'white', 4),
 (113, 'Rose', 'red', 6),
 (114, 'Tulip', 'yellow', 2),
 (115, 'Violet', 'purple', 6),
 (116, 'Daffodil', 'brown', 3),
 (117, 'Daisy', 'orange', 4),
 (118, 'Rose', 'pink', 6),
 (119, 'Tulip', 'white', 2),
 (120, 'Violet', 'magenta', 6)]

### This tests the combination B and D (type and leaves)

In [113]:
%%sql
SELECT COUNT(*)
FROM Flowers5 F1, Flowers5 F2
WHERE (F1.type = F2.type AND F1.leaves = F2.leaves) AND (F1.id != F2.id OR F1.color != F2.color)

 * sqlite:///lab4.db3
Done.

[(10,)]

### Here, I created a new table similar to the original so combination C and D would fail

In [114]:
%%sql drop table if exists Flowers6;     --drops the table if it already exists
create table Flowers6(
       id       int,
       type     string,
       color    string,
       leaves   int
);
insert into Flowers6 values('111', 'Daffodil', 'white', '3');
insert into Flowers6 values('112', 'Daisy', 'orange', '4');
insert into Flowers6 values('113', 'Rose', 'red', '6');
insert into Flowers6 values('114', 'Tulip', 'yellow', '2');
insert into Flowers6 values('115', 'Violet', 'purple', '5');
insert into Flowers6 values('116', 'Daffodil', 'white', '3');
insert into Flowers6 values('117', 'Daisy', 'orange', '4');
insert into Flowers6 values('118', 'Rose', 'red', '6');
insert into Flowers6 values('119', 'Tulip', 'yellow', '2');
insert into Flowers6 values('120', 'Violet', 'purple', '5');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This prints the table Flowers6

In [115]:
%%sql
select *
from Flowers6

 * sqlite:///lab4.db3
Done.

[(111, 'Daffodil', 'white', 3),
 (112, 'Daisy', 'orange', 4),
 (113, 'Rose', 'red', 6),
 (114, 'Tulip', 'yellow', 2),
 (115, 'Violet', 'purple', 5),
 (116, 'Daffodil', 'white', 3),
 (117, 'Daisy', 'orange', 4),
 (118, 'Rose', 'red', 6),
 (119, 'Tulip', 'yellow', 2),
 (120, 'Violet', 'purple', 5)]

### This tests the combination C and D (color and leaves)

In [116]:
%%sql
SELECT COUNT(*)
FROM Flowers6 F1, Flowers6 F2
WHERE (F1.color = F2.color AND F1.leaves = F2.leaves) AND (F1.id != F2.id OR F1.type != F2.type)

 * sqlite:///lab4.db3
Done.

[(10,)]

# Question 3
## For this question, I am using a Sailors table and 2 Reserves tables. One Reserves table meets the conditions and the other does not.

### This is the Sailors table

In [117]:
%%sql drop table if exists Sailors;     --drops the table if it already exists
create table Sailors(
       sid       int primary key,
       sname     string,
       rating    int,
       age       float
);
insert into Sailors values('22', 'dustin', '7', '45.0');
insert into Sailors values('31', 'lubber', '8', '55.5');
insert into Sailors values('58', 'rusty', '10', '35.0');
insert into Sailors values('45', 'redbeard', '12', '40.0');
insert into Sailors values('61', 'blackbeard', '9', '41.0');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This is the correct Reserves table

In [118]:
%%sql drop table if exists Reserves;
pragma foreign_keys = ON;
create table Reserves(
       sid     int,
       bid     int,
       sname   string,
       bname   string,
       date    date primary key
);
insert into Reserves values('22', '101', 'dustin', 'clipper', '10/10/96');
insert into Reserves values('31', '105', 'lubber', 'watercar', '12/11/96');
insert into Reserves values('58', '103', 'rusty', 'boaty', '11/12/96');
insert into Reserves values('45', '101', 'redbeard', 'clipper', '10/20/96');
insert into Reserves values('61', '104', 'blackbeard', 'floaty', '11/14/96');

 * sqlite:///lab4.db3
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This is the incorrect Reserves table

In [119]:
%%sql drop table if exists WrongReserves;
pragma foreign_keys = ON;
create table WrongReserves(
       sid     int,
       bid     int,
       sname   string,
       bname   string,
       date    date primary key
);
insert into WrongReserves values('22', '101', 'dustin', 'clipper', '10/10/96');
insert into WrongReserves values('31', '105', 'lubber', 'watercar', '12/11/96');
insert into WrongReserves values('58', '103', 'rusty', 'boaty', '11/12/96');
insert into WrongReserves values('45', '101', 'redbeard', 'clipper', '10/20/96');
insert into WrongReserves values('61', '104', 'bluebeard', 'floaty', '11/14/96');

 * sqlite:///lab4.db3
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### This checks for a TGD between Sailors and Reserves

In [120]:
%%sql
SELECT *
FROM Sailors s
WHERE NOT EXISTS(
    SELECT *
    FROM Reserves r
    WHERE s.sid = r.sid AND s.sname = r.sname)

 * sqlite:///lab4.db3
Done.

[]

### This checks for a TGD between Sailors and WrongReserves

In [121]:
%%sql
SELECT COUNT(*)
FROM Sailors s
WHERE NOT EXISTS(
    SELECT *
    FROM WrongReserves w
    WHERE s.sid = w.sid AND s.sname = w.sname)

 * sqlite:///lab4.db3
Done.

[(1,)]